
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hayas1/tfgh/actions/runs/11840395677)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["devcontainer-features"].github_repository.this: Refreshing state... [id=devcontainer-features]
module.repositories["dyson-rs"].github_branch.default: Refreshing state... [id=dyson-rs:master]
module.repositories["devcontainer-features"].github_branch.default: Refreshing state... [id=devcontainer-features:main]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["devcontainer-features"].github_issue_label.this["breaking"]: Refreshing state... [id=devcontainer-features:breaking]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Refreshing state... [id=dyson-rs:feature]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["tfgh"].github_branch.default: Refreshing state... [id=tfgh:main]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["devcontainer-features"].github_repository_ruleset.this: Refreshing state... [id=2602488]
module.repositories["dyson-rs"].github_repository_ruleset.this: Refreshing state... [id=2589508]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Refreshing state... [id=dyson-rs:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["maintenance"]: Refreshing state... [id=devcontainer-features:maintenance]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Refreshing state... [id=dyson-rs:maintenance]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["devcontainer-features"].github_issue_label.this["feature"]: Refreshing state... [id=devcontainer-features:feature]
module.repositories["devcontainer-features"].github_issue_label.this["bugfix"]: Refreshing state... [id=devcontainer-features:bugfix]
module.repositories["devcontainer-features"].github_issue_label.this["deps"]: Refreshing state... [id=devcontainer-features:deps]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Refreshing state... [id=dyson-rs:refactor]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Refreshing state... [id=dyson-rs:documentation]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Refreshing state... [id=dyson-rs:bugfix]
module.repositories["devcontainer-features"].github_issue_label.this["documentation"]: Refreshing state... [id=devcontainer-features:documentation]
module.repositories["devcontainer-features"].github_issue_label.this["refactor"]: Refreshing state... [id=devcontainer-features:refactor]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Refreshing state... [id=dyson-rs:deps]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["devcontainer-features"].github_branch_default.this: Refreshing state... [id=devcontainer-features]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["dyson-rs"].github_branch.managed: Refreshing state... [id=dyson-rs:chore/managed-by-terraform]
module.repositories["devcontainer-features"].github_branch.managed: Refreshing state... [id=devcontainer-features:chore/managed-by-terraform]
module.repositories["tfgh"].github_branch.managed: Refreshing state... [id=tfgh:chore/managed-by-terraform]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=devcontainer-features/.github/issue_template.md]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/workflows/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=dyson-rs/.github/release.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=devcontainer-features/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tfgh/.github/issue_template.md]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=devcontainer-features/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=dyson-rs/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:devcontainer-features:42]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:65]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:dyson-rs:9]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"19ae9a7125c8647ef5d93fed50cc4cedaaa225aec8fe85aa82f0d05bc1ec0ee7\"" -> "W/\"3cde8a8e359cf2d855653406f15bedf132319c52dbd403da679dc7ba434cebda\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"865c96a3d6400da1c63c534dde0bb10473295f38f028185564acfb9c3f1bbf53\"" -> "W/\"e26cfeabaa904893451d0786f231e72ea78c233735d13c2cbef12f74f6b2f6e0\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"b0b6c5320d5ce112d147784e666c2bb9e83faf816121f8b446ab474e9bdd5fd3\"" -> "W/\"a13ef11f44665a55383eae81ebcc2d6e03f7ff42ea38621f7a24e7166458d146\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repositories["tfgh"].github_branch.managed will be created
  + resource "github_branch" "managed" {
      + branch        = "chore/managed-by-terraform"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "tfgh"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Expectation :butterfly:
            > What behavior is expected?
            
            # Reality :bug:
            > How does it actually work?
            
            # Environment :evergreen_tree:
            > (When and) Where the behavior was observed?
            
            # Cause :mag:
            > Why this issue was occurred?
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "tfgh"
      + sha                          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
module.repositories["tfgh"].github_branch.managed: Creating...
module.repositories["tfgh"].github_branch.managed: Creation complete after 1s [id=tfgh:chore/managed-by-terraform]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Creating...
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Creation complete after 2s [id=tfgh/.github/issue_template.md]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":65,"Program":"tfcmt","SHA1":"ed5d20aed06327c00ddbad9361dd1d503ef36c79","Vars":{},"WorkflowName":"Terraform apply on push"} -->